if balans >= 100:
            print(f"{name} помыт! -100 рублей")
            balans -= 100
            chistota = min(100, chistota + 30)  # +30% чистоты, но не больше 100
            energiya = max(0, energiya - 10)
            print(f"Чистота: {chistota}%, Энергия: {energiya}%")
        else:
            print("Недостаточно денег!")

            # После всех действий, но ДО следующего цикла
            # Параметры ухудшаются со временем:
            golod = min(100, golod + 5)  # становится голоднее
            energiya = max(0, energiya - 3)  # устает
            chistota = max(0, chistota - 2)  # пачкается

            # Если голод > 80, здоровье падает
            if golod > 80:
                zdorovie -= 5
                print(f"⚠️ {name} слишком голоден! Здоровье уменьшается!")

            # Проверка на смерть
            if zdorovie <= 0 or golod >= 100:
                print(f"💀 {name} умер! Игра окончена.")
                break

    elif deistvie == 4:


        if balans >= 200:
            print(f"{name} у ветеринара! -200 рублей")
            balans -= 200
            zdorovie = min(100, zdorovie + 40)  # +40% здоровья
            print(f"Здоровье: {zdorovie}%")
        else:
            print("Недостаточно денег!")

            # После всех действий, но ДО следующего цикла
            # Параметры ухудшаются со временем:
            golod = min(100, golod + 5)  # становится голоднее
            energiya = max(0, energiya - 3)  # устает
            chistota = max(0, chistota - 2)  # пачкается

            # Если голод > 80, здоровье падает
            if golod > 80:
                zdorovie -= 5
                print(f"⚠️ {name} слишком голоден! Здоровье уменьшается!")

            # Проверка на смерть
            if zdorovie <= 0 or golod >= 100:
                print(f"💀 {name} умер! Игра окончена.")
                break

    elif deistvie == 5:

        print(f"\n=== СОСТОЯНИЕ {name} ===")
        print(f"💰 Баланс: {balans} рублей")
        print(f"❤️ Здоровье: {zdorovie}%")
        print(f"🍎 Голод: {golod}%")
        print(f"😊 Настроение: {nastroenie}%")
        print(f"⚡️ Энергия: {energiya}%")
        print(f"🛁 Чистота: {chistota}%")

        # После всех действий, но ДО следующего цикла
        # Параметры ухудшаются со временем:
        golod = min(100, golod + 5)  # становится голоднее
        energiya = max(0, energiya - 3)  # устает
        chistota = max(0, chistota - 2)  # пачкается

        # Если голод > 80, здоровье падает
        if golod > 80:
            zdorovie -= 5
            print(f"⚠️ {name} слишком голоден! Здоровье уменьшается!")

        # Проверка на смерть
        if zdorovie <= 0 or golod >= 100:
            print(f"💀 {name} умер! Игра окончена.")
            break





    elif deistvie == 6:
        print('Спасибо что по играли в нашу игру!😊😍')
        break
